# 프로그래밍 핵심 개념 in Python
# 4. 문제 해결 능력 기르기
# 01. 챕터 소개

# 참고

# 여러분을 응원합니다!
# 이제 프로그래밍의 핵심 개념이라고 할 수 있는 자료형, 추상화, 그리고 제어문에 대해 배웠습니다.
# 이런 개념을 처음 접하신 분들에게는 쉽지 않은 내용일 텐데요,
# 여기까지 제대로 배우셨다면 프로그래밍의 무궁한 가능성에 한발 내디뎠다고 볼 수 있어요.

# 다음 스텝은...?
# 이제 이 개념을 활용해서 문제를 풀어 볼 차례입니다.
# 프로그래밍은 결국 실생활의 문제를 해결하고 우리에게 가치를 더해 주어야 의미가 있는데요.
# 지금까지 배운 개념들을 활용하고, 때로는 여러 개념을 함께 사용해야 풀 수 있는 문제를 여러 난이도로 준비해 두었어요.

# 주의: 어려울 수 있어요
# 배운 개념들을 활용해서 주어진 문제를 풀어낸다는 것이 어려울 수 있습니다.
# 오래 생각이 필요한 문제도 있을 거예요.
# 하지만 한번 도전해 보세요!
# 충분한 시간을 갖고 여러 방식으로 시도해 보다 보면,
# 여러분의 문제 해결 능력과 컴퓨터적 사고 능력이 점차 향상될 거예요.

# 문제 풀이 과정을 생략하고 넘어갈 수도 있지만,
# 여러분이 프로그래밍을 더 많이 활용하고 싶을수록 더 복잡한 문제들을 풀어나가야 하고,
# 그럴 때 이런 과정이 빛을 발할 거예요.
# 문제 해결 능력이 충분히 길러지지 못하면 문제를 풀지 못해서 막히는 상황에 결국 부딪히게 됩니다.

# 의미 있는 결과물을 만들기 위해서는 필요한 과정이니까요,
# 준비한 실습들을 하나씩 도전해 보세요.
# 어려움에 부딪히면 힌트를 활용하셔도 좋고,
# 다른 분들의 커뮤니티 질문과 답변을 참고해도 좋아요!